IDEA Open Model
FoldedPlateData Class
Compatible with IDEA StatiCa 20.1
 Provides data of the folded plate
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Connection.FoldedPlateData
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class FoldedPlateData
Public Class FoldedPlateData
The FoldedPlateData type exposes the following members.
Constructors
Name | Description
FoldedPlateData
Initializes a new instance of the FoldedPlateData class
Top
Properties
Name | Description
Bends
 List of bends connected plates of foldedplate
Plates
 List of plates belong to folded plate
Top
See Also
Reference
IdeaRS.OpenModel.Connection Namespace